# Chapter 6

In [72]:
import csv
import pandas as pd
import sys
import numpy as np
import json

In [51]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

ABOVE, YOU SEE THAT ALL IT DOES IS PRINT THE DATA. IT STILL GIVES AN ERROR THOUGH.

In [11]:
df = pd.read_csv('examples/ex1.csv')

In [12]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [50]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [17]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [18]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
names = ['a','b','c','d','message']

In [21]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

Cool, that switched the strings from the right side to the left side

In [22]:
parsed = pd.read_csv('examples/csv_mindex.csv',
index_col=['key1', 'key2'])

In [23]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [25]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [26]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
result = pd.read_csv('examples/ex5.csv')

In [29]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [31]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [32]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
sentinels = {'message':['foo', 'NA'], 'something': ['two']}

In [34]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [35]:
pd.options.display.max_rows = 10

THIS IS ONLY GOING TO SHOW THE TEXT FILES IN PIECES

In [36]:
result = pd.read_csv('examples/ex6.csv')

In [37]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [38]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [39]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [40]:
chunker

In [41]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [42]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

<ipython-input-42-ff8a04991e79>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [43]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [44]:
data = pd.read_csv('examples/ex5.csv')

In [45]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
data.to_csv('examples/out.csv')

In [49]:
data.to_csv(sys.stdout, sep= '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [52]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [53]:
dates = pd.date_range('1/1/2000', periods=7)

In [56]:
ts = pd.Series(np.arange(7), index=dates)

In [57]:
ts.to_csv('examples/tseries.csv')

In [58]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [59]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [60]:
f = open('examples/ex7.csv')

In [61]:
reader = csv.reader(f)

In [62]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [63]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [64]:
header, values = lines[0], lines[1:]

In [65]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [66]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [68]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [70]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [75]:
import json

In [80]:
obj = """
{"name":"Wes",
"places_lived: ["United States", "Spain", "Germany"],
"pet" : null,
"siblings": [{"name":"Scott", "age":30, "pets":["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets" : ["Sixes", "Stache", "Cisco"]}]
}
"""

In [81]:
result = json.loads(obj)

JSONDecodeError: Expecting ':' delimiter: line 3 column 18 (char 33)

In [79]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [83]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [84]:
data = pd.read_json('examples/example.json')

In [85]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [86]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [87]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [88]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [89]:
len(tables)

1

In [90]:
failures = tables[0]

In [91]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [92]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [93]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2001      4
2004      4
2003      3
2007      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [106]:
from lxml import objectify
path = 'examples/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [100]:
path = 'examples/mta_perf/Performance_MNR.xml'

In [96]:
parsed = objectify.parse(open(path))

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [101]:
perf = pd.DataFrame(data)

In [102]:
perf.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [105]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [107]:
root

In [108]:
root.get('href')

'http://www.google.com'

the 'HREF' is the website url name

In [109]:
root.text

'Google'

In [110]:
frame = pd.read_csv('examples/ex1.csv')

In [111]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [112]:
frame.to_pickle('examples/frame_pickle')

In [113]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [114]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [115]:
store = pd.HDFStore('mydata.h5')

In [116]:
store['obj1'] = frame

In [117]:
store['obj1_col'] = frame['a']

In [118]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [119]:
store['obj1']

           a
0   0.477034
1  -0.783613
2   0.116028
3   0.095422
4  -0.553770
..       ...
95  0.169228
96 -1.179486
97  0.468157
98  1.595609
99 -2.040804

[100 rows x 1 columns]

In [120]:
store.put('obj2', frame, format='table')

In [121]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.729777
11 -1.619351
12  0.658813
13 -1.004873
14  1.003796
15  1.315516

In [122]:
store.close()

In [123]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [124]:
pd.read_hdf('mydata.h5', 'obj3', where=['index <5'])

          a
0  0.477034
1 -0.783613
2  0.116028
3  0.095422
4 -0.553770

In [125]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [126]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [127]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [128]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [129]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [130]:
frame.to_excel(writer, "Sheet1")

In [131]:
writer.save()

In [132]:
frame.to_excel('examples/ex2.xlsx')

In [133]:
import requests

In [134]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [135]:
resp = requests.get(url)

In [136]:
resp

In [137]:
data = resp.json()

In [138]:
data[0]['title']

'REF: implement _maybe_squeeze_arg'

In [140]:
issues = pd.DataFrame(data, columns=['number', 'title','lables', 'state'])

In [141]:
issues

    number                                              title  lables state
0    44520                  REF: implement _maybe_squeeze_arg     NaN  open
1    44519  REF: remove unused allow_object kwarg from seq...     NaN  open
2    44518       BUG: DataFrame with scalar tzaware Timestamp     NaN  open
3    44517  BUG: groupby(..., dropna=False).filter() never...     NaN  open
4    44514  BUG: IntegerArray/FloatingArray constructors m...     NaN  open
..     ...                                                ...     ...   ...
25   44486  ENH: DataFrame.sample should accept numpy.rand...     NaN  open
26   44485  BUG: dataframe.replace({np.nan: None}) failed ...     NaN  open
27   44484  API (BUG?): DatetimeArray.astype vs to_numpy b...     NaN  open
28   44483  BUG: fix get_indexer_non_unique() with 'object...     NaN  open
29   44482  BUG: get_indexer_non_unique() does not handle ...     NaN  open

[30 rows x 4 columns]

In [142]:
import sqlite3

In [147]:
query = """
[('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]"""

Does this want me to import some kind of table????

In [148]:
con = sqlite3.connect('mydata.sqlite')

In [149]:
con.execute(query)

OperationalError: near "[('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]": syntax error

I NEED SOME HELP WITH THIS LAST PART. WHAT IS HAPPENING HERE